FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_GPIO.c
/*-------------------------------------------------------------------------*
 * File:  GPIO.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC546xx GPIO Interface.
 * Implementation:
 *      A single GPIO0 is created, but the code can be easily changed for
 *      other processors to use multiple GPIO busses.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://goo.gl/UDtTCR for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!  |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <Config.h>
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <HAL/Interrupt.h>
#include <Source/Processor/NXP/LPC546xx/LPC546xx_GPIO.h>
#include <stdio.h>

//TODO: Remove testing
#include "iar/Include/CMSIS/LPC54608.h"

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    TVUInt32 *iIOPIN;
    TVUInt32 *iIOSET;
    TVUInt32 *iIOCLR;
    TVUInt32 *iIODIR;

    TVUInt32 *iIOCONTable[32];
} LPC546xx_GPIO_PortInfo;

typedef struct {
    const HAL_GPIOPort *iHAL;
    const LPC546xx_GPIO_PortInfo *iPortInfo;
    TUInt32 iLocked;
} T_LPC546xx_GPIO_Workspace;

typedef struct {
    TUInt32 iPortPin;
    T_gpioInterruptHandler iInterruptCallback;
    void *iInterruptCallbackWorkspace;
    T_gpioInterruptType iInterruptType;
}T_GPIO_Interrupt;

typedef struct {
    TVInt32 *iPINTSEL; //interrupt select register for int.
    TVInt32 *iISEL;     /*!< Pin Interrupt Mode register */
    TVInt32 *iIENR;     /*!< Pin Interrupt Enable (Rising) register */
    TVInt32 *iSIENR;    /*!< Set Pin Interrupt Enable (Rising) register */
    TVInt32 *iCIENR;    /*!< Clear Pin Interrupt Enable (Rising) register */
    TVInt32 *iIENF;     /*!< Pin Interrupt Enable Falling Edge / Active Level register */
    TVInt32 *iSIENF;    /*!< Set Pin Interrupt Enable Falling Edge / Active Level register */
    TVInt32 *iCIENF;    /*!< Clear Pin Interrupt Enable Falling Edge / Active Level address */
    TVInt32 *iRISE;     /*!< Pin Interrupt Rising Edge register */
    TVInt32 *iFALL;     /*!< Pin Interrupt Falling Edge register */
    TVInt32 *iIST;      /*!< Pin Interrupt Status register */
    TVInt32 *iPMCTRL;      /**< Pattern match interrupt control register, offset: 0x28 */
    TVInt32 *iPMSRC;      /**< Pattern match interrupt bit-slice source register, offset: 0x2C */
    TVInt32 *iPMCFG;      /**< Pattern match interrupt bit slice configuration register, offset: 0x30 */

    TUInt32 iConfiguredInterrupts;
    TUInt32 iInterruptNumber[8];
    TUInt8 iInterruptName[8][10];
    T_GPIO_Interrupt iInterrupt[8];
}T_LPC546xx_GPIO_Interrupt_Workspace;

/*---------------------------------------------------------------------------*
 * Prototypes:
 *---------------------------------------------------------------------------*/
void LPC546xx_GPIO_ProcessIRQ(TUInt32 aInterrupt);

/*---------------------------------------------------------------------------*
 * Globals and Tables:
 *---------------------------------------------------------------------------*/
static T_LPC546xx_GPIO_Interrupt_Workspace G_Interrupt_Workspace = {
    (TVInt32 *)&INPUTMUX->PINTSEL,
    (TVInt32 *)&PINT->ISEL,
    (TVInt32 *)&PINT->IENR,
    (TVInt32 *)&PINT->SIENR,
    (TVInt32 *)&PINT->CIENR,
    (TVInt32 *)&PINT->IENF,
    (TVInt32 *)&PINT->SIENF,
    (TVInt32 *)&PINT->CIENF,
    (TVInt32 *)&PINT->RISE,
    (TVInt32 *)&PINT->FALL,
    (TVInt32 *)&PINT->IST,
    0,
    0,
    0,
    0,
    {
        PIN_INT0_IRQn,  /*!<  32  PIN_INT0 */
        PIN_INT1_IRQn,  /*!<  33  PIN_INT1 */
        PIN_INT2_IRQn,  /*!<  34  PIN_INT2 */
        PIN_INT3_IRQn,  /*!<  35  PIN_INT3 */
        PIN_INT4_IRQn,  /*!<  36  PIN_INT4 */
        PIN_INT5_IRQn,  /*!<  37  PIN_INT5 */
        PIN_INT6_IRQn,  /*!<  38  PIN_INT6 */
        PIN_INT7_IRQn,  /*!<  39  PIN_INT7 */
    },
    {
        "PIN_INT0",
        "PIN_INT1",
        "PIN_INT2",
        "PIN_INT3",
        "PIN_INT4",
        "PIN_INT5",
        "PIN_INT6",
        "PIN_INT7",
    },
};

const LPC546xx_GPIO_PortInfo GPIO_LPC546xx_Port0_PortInfo
= {
    (TUInt32 *)&GPIO->PIN[0],
    (TUInt32 *)&GPIO->SET[0],
    (TUInt32 *)&GPIO->CLR[0],
    (TUInt32 *)&GPIO->DIR[0],
    {
        (TUInt32 *)&IOCON->PIO[0][0],
        (TUInt32 *)&IOCON->PIO[0][1],
        (TUInt32 *)&IOCON->PIO[0][2],
        (TUInt32 *)&IOCON->PIO[0][3],
        (TUInt32 *)&IOCON->PIO[0][4],
        (TUInt32 *)&IOCON->PIO[0][5],
        (TUInt32 *)&IOCON->PIO[0][6],
        (TUInt32 *)&IOCON->PIO[0][7],
        (TUInt32 *)&IOCON->PIO[0][8],
        (TUInt32 *)&IOCON->PIO[0][9],
        (TUInt32 *)&IOCON->PIO[0][10],
        (TUInt32 *)&IOCON->PIO[0][11],
        (TUInt32 *)&IOCON->PIO[0][12],
        (TUInt32 *)&IOCON->PIO[0][13],
        (TUInt32 *)&IOCON->PIO[0][14],
        (TUInt32 *)&IOCON->PIO[0][15],
        (TUInt32 *)&IOCON->PIO[0][16],
        (TUInt32 *)&IOCON->PIO[0][17],
        (TUInt32 *)&IOCON->PIO[0][18],
        (TUInt32 *)&IOCON->PIO[0][19],
        (TUInt32 *)&IOCON->PIO[0][20],
        (TUInt32 *)&IOCON->PIO[0][21],
        (TUInt32 *)&IOCON->PIO[0][22],
        (TUInt32 *)&IOCON->PIO[0][23],
        (TUInt32 *)&IOCON->PIO[0][24],
        (TUInt32 *)&IOCON->PIO[0][25],
        (TUInt32 *)&IOCON->PIO[0][26],
        (TUInt32 *)&IOCON->PIO[0][27],
        (TUInt32 *)&IOCON->PIO[0][28],
        (TUInt32 *)&IOCON->PIO[0][29],
        (TUInt32 *)&IOCON->PIO[0][30],
        (TUInt32 *)&IOCON->PIO[0][31],
    }
};

const LPC546xx_GPIO_PortInfo GPIO_LPC546xx_Port1_PortInfo = {
        (TUInt32 *)&GPIO->PIN[1],
        (TUInt32 *)&GPIO->SET[1],
        (TUInt32 *)&GPIO->CLR[1],
        (TUInt32 *)&GPIO->DIR[1],
        {
                (TUInt32 *)&IOCON->PIO[1][0],
                (TUInt32 *)&IOCON->PIO[1][1],
                (TUInt32 *)&IOCON->PIO[1][2],
                (TUInt32 *)&IOCON->PIO[1][3],
                (TUInt32 *)&IOCON->PIO[1][4],
                (TUInt32 *)&IOCON->PIO[1][5],
                (TUInt32 *)&IOCON->PIO[1][6],
                (TUInt32 *)&IOCON->PIO[1][7],
                (TUInt32 *)&IOCON->PIO[1][8],
                (TUInt32 *)&IOCON->PIO[1][9],
                (TUInt32 *)&IOCON->PIO[1][10],
                (TUInt32 *)&IOCON->PIO[1][11],
                (TUInt32 *)&IOCON->PIO[1][12],
                (TUInt32 *)&IOCON->PIO[1][13],
                (TUInt32 *)&IOCON->PIO[1][14],
                (TUInt32 *)&IOCON->PIO[1][15],
                (TUInt32 *)&IOCON->PIO[1][16],
                (TUInt32 *)&IOCON->PIO[1][17],
                (TUInt32 *)&IOCON->PIO[1][18],
                (TUInt32 *)&IOCON->PIO[1][19],
                (TUInt32 *)&IOCON->PIO[1][20],
                (TUInt32 *)&IOCON->PIO[1][21],
                (TUInt32 *)&IOCON->PIO[1][22],
                (TUInt32 *)&IOCON->PIO[1][23],
                (TUInt32 *)&IOCON->PIO[1][24],
                (TUInt32 *)&IOCON->PIO[1][25],
                (TUInt32 *)&IOCON->PIO[1][26],
                (TUInt32 *)&IOCON->PIO[1][27],
                (TUInt32 *)&IOCON->PIO[1][28],
                (TUInt32 *)&IOCON->PIO[1][29],
                (TUInt32 *)&IOCON->PIO[1][30],
                (TUInt32 *)&IOCON->PIO[1][31], }

