FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_GPIO.c
};

const LPC546xx_GPIO_PortInfo GPIO_LPC546xx_Port2_PortInfo
= {
    (TUInt32 *)&GPIO->PIN[2],
    (TUInt32 *)&GPIO->SET[2],
    (TUInt32 *)&GPIO->CLR[2],
    (TUInt32 *)&GPIO->DIR[2],
    {
        (TUInt32 *)&IOCON->PIO[2][0],
        (TUInt32 *)&IOCON->PIO[2][1],
        (TUInt32 *)&IOCON->PIO[2][2],
        (TUInt32 *)&IOCON->PIO[2][3],
        (TUInt32 *)&IOCON->PIO[2][4],
        (TUInt32 *)&IOCON->PIO[2][5],
        (TUInt32 *)&IOCON->PIO[2][6],
        (TUInt32 *)&IOCON->PIO[2][7],
        (TUInt32 *)&IOCON->PIO[2][8],
        (TUInt32 *)&IOCON->PIO[2][9],
        (TUInt32 *)&IOCON->PIO[2][10],
        (TUInt32 *)&IOCON->PIO[2][11],
        (TUInt32 *)&IOCON->PIO[2][12],
        (TUInt32 *)&IOCON->PIO[2][13],
        (TUInt32 *)&IOCON->PIO[2][14],
        (TUInt32 *)&IOCON->PIO[2][15],
        (TUInt32 *)&IOCON->PIO[2][16],
        (TUInt32 *)&IOCON->PIO[2][17],
        (TUInt32 *)&IOCON->PIO[2][18],
        (TUInt32 *)&IOCON->PIO[2][19],
        (TUInt32 *)&IOCON->PIO[2][20],
        (TUInt32 *)&IOCON->PIO[2][21],
        (TUInt32 *)&IOCON->PIO[2][22],
        (TUInt32 *)&IOCON->PIO[2][23],
        (TUInt32 *)&IOCON->PIO[2][24],
        (TUInt32 *)&IOCON->PIO[2][25],
        (TUInt32 *)&IOCON->PIO[2][26],
        (TUInt32 *)&IOCON->PIO[2][27],
        (TUInt32 *)&IOCON->PIO[2][28],
        (TUInt32 *)&IOCON->PIO[2][29],
        (TUInt32 *)&IOCON->PIO[2][30],
        (TUInt32 *)&IOCON->PIO[2][31],
    }
};

const LPC546xx_GPIO_PortInfo GPIO_LPC546xx_Port3_PortInfo = {
        (TUInt32 *)&GPIO->PIN[3],
        (TUInt32 *)&GPIO->SET[3],
        (TUInt32 *)&GPIO->CLR[3],
        (TUInt32 *)&GPIO->DIR[3],
        {
                (TUInt32 *)&IOCON->PIO[3][0],
                (TUInt32 *)&IOCON->PIO[3][1],
                (TUInt32 *)&IOCON->PIO[3][2],
                (TUInt32 *)&IOCON->PIO[3][3],
                (TUInt32 *)&IOCON->PIO[3][4],
                (TUInt32 *)&IOCON->PIO[3][5],
                (TUInt32 *)&IOCON->PIO[3][6],
                (TUInt32 *)&IOCON->PIO[3][7],
                (TUInt32 *)&IOCON->PIO[3][8],
                (TUInt32 *)&IOCON->PIO[3][9],
                (TUInt32 *)&IOCON->PIO[3][10],
                (TUInt32 *)&IOCON->PIO[3][11],
                (TUInt32 *)&IOCON->PIO[3][12],
                (TUInt32 *)&IOCON->PIO[3][13],
                (TUInt32 *)&IOCON->PIO[3][14],
                (TUInt32 *)&IOCON->PIO[3][15],
                (TUInt32 *)&IOCON->PIO[3][16],
                (TUInt32 *)&IOCON->PIO[3][17],
                (TUInt32 *)&IOCON->PIO[3][18],
                (TUInt32 *)&IOCON->PIO[3][19],
                (TUInt32 *)&IOCON->PIO[3][20],
                (TUInt32 *)&IOCON->PIO[3][21],
                (TUInt32 *)&IOCON->PIO[3][22],
                (TUInt32 *)&IOCON->PIO[3][23],
                (TUInt32 *)&IOCON->PIO[3][24],
                (TUInt32 *)&IOCON->PIO[3][25],
                (TUInt32 *)&IOCON->PIO[3][26],
                (TUInt32 *)&IOCON->PIO[3][27],
                (TUInt32 *)&IOCON->PIO[3][28],
                (TUInt32 *)&IOCON->PIO[3][29],
                (TUInt32 *)&IOCON->PIO[3][30],
                (TUInt32 *)&IOCON->PIO[3][31], } };

const LPC546xx_GPIO_PortInfo GPIO_LPC546xx_Port4_PortInfo = {
        (TUInt32 *)&GPIO->PIN[4],
        (TUInt32 *)&GPIO->SET[4],
        (TUInt32 *)&GPIO->CLR[4],
        (TUInt32 *)&GPIO->DIR[4],
        {
                (TUInt32 *)&IOCON->PIO[4][0],
                (TUInt32 *)&IOCON->PIO[4][1],
                (TUInt32 *)&IOCON->PIO[4][2],
                (TUInt32 *)&IOCON->PIO[4][3],
                (TUInt32 *)&IOCON->PIO[4][4],
                (TUInt32 *)&IOCON->PIO[4][5],
                (TUInt32 *)&IOCON->PIO[4][6],
                (TUInt32 *)&IOCON->PIO[4][7],
                (TUInt32 *)&IOCON->PIO[4][8],
                (TUInt32 *)&IOCON->PIO[4][9],
                (TUInt32 *)&IOCON->PIO[4][10],
                (TUInt32 *)&IOCON->PIO[4][11],
                (TUInt32 *)&IOCON->PIO[4][12],
                (TUInt32 *)&IOCON->PIO[4][13],
                (TUInt32 *)&IOCON->PIO[4][14],
                (TUInt32 *)&IOCON->PIO[4][15],
                (TUInt32 *)&IOCON->PIO[4][16],
                (TUInt32 *)&IOCON->PIO[4][17],
                (TUInt32 *)&IOCON->PIO[4][18],
                (TUInt32 *)&IOCON->PIO[4][19],
                (TUInt32 *)&IOCON->PIO[4][20],
                (TUInt32 *)&IOCON->PIO[4][21],
                (TUInt32 *)&IOCON->PIO[4][22],
                (TUInt32 *)&IOCON->PIO[4][23],
                (TUInt32 *)&IOCON->PIO[4][24],
                (TUInt32 *)&IOCON->PIO[4][25],
                (TUInt32 *)&IOCON->PIO[4][26],
                (TUInt32 *)&IOCON->PIO[4][27],
                (TUInt32 *)&IOCON->PIO[4][28],
                (TUInt32 *)&IOCON->PIO[4][29],
                (TUInt32 *)&IOCON->PIO[4][30],
                (TUInt32 *)&IOCON->PIO[4][31], } };

const LPC546xx_GPIO_PortInfo GPIO_LPC546xx_Port5_PortInfo = {
        (TUInt32 *)&GPIO->PIN[5],
        (TUInt32 *)&GPIO->SET[5],
        (TUInt32 *)&GPIO->CLR[5],
        (TUInt32 *)&GPIO->DIR[5],
        {
                (TUInt32 *)&IOCON->PIO[5][0],
                (TUInt32 *)&IOCON->PIO[5][1],
                (TUInt32 *)&IOCON->PIO[5][2],
                (TUInt32 *)&IOCON->PIO[5][3],
                (TUInt32 *)&IOCON->PIO[5][4],
                (TUInt32 *)&IOCON->PIO[5][5],
                (TUInt32 *)&IOCON->PIO[5][6],
                (TUInt32 *)&IOCON->PIO[5][7],
                (TUInt32 *)&IOCON->PIO[5][8],
                (TUInt32 *)&IOCON->PIO[5][9],
                (TUInt32 *)&IOCON->PIO[5][10],
                0, /* 11 */
                0, /* 12 */
                0, /* 13 */
                0, /* 14 */
                0, /* 15 */
                (TUInt32 *)&IOCON->PIO[5][16],
                (TUInt32 *)&IOCON->PIO[5][17],
                (TUInt32 *)&IOCON->PIO[5][18],
                (TUInt32 *)&IOCON->PIO[5][19],
                (TUInt32 *)&IOCON->PIO[5][20],
                (TUInt32 *)&IOCON->PIO[5][21],
                (TUInt32 *)&IOCON->PIO[5][22],
                (TUInt32 *)&IOCON->PIO[5][23],
                (TUInt32 *)&IOCON->PIO[5][24],
                (TUInt32 *)&IOCON->PIO[5][25],
                (TUInt32 *)&IOCON->PIO[5][26],
                0, /* 27 */
                0, /* 28 */
                0, /* 29 */
                0, /* 30 */
                0, /* 31 */
        } };

//static T_LPC546xx_GPIO_Workspace *G_LPC546xxPort0Workspace = 0;
//static T_LPC546xx_GPIO_Workspace *G_LPC546xxPort2Workspace = 0;

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPIO_Port0_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC546xx GPIO Port0 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPIO_Port0_InitializeWorkspace(void *aWorkspace)
{
    T_LPC546xx_GPIO_Workspace *p = (T_LPC546xx_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC546xx_Port0_PortInfo;
    //G_LPC546xxPort0Workspace = p;
    p->iLocked = 0;

