FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_GPIO.c
    LPC546xxPowerOn(kCLOCK_InputMux);
    LPC546xxPowerOn(kCLOCK_Gpio0);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPIO_Port1_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC546xx GPIO Port1 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPIO_Port1_InitializeWorkspace(void *aWorkspace)
{
    T_LPC546xx_GPIO_Workspace *p = (T_LPC546xx_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC546xx_Port1_PortInfo;
    p->iLocked = 0;

    LPC546xxPowerOn(kCLOCK_InputMux);
    LPC546xxPowerOn(kCLOCK_Gpio1);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPIO_Port2_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC546xx GPIO Port2 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPIO_Port2_InitializeWorkspace(void *aWorkspace)
{
    T_LPC546xx_GPIO_Workspace *p = (T_LPC546xx_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC546xx_Port2_PortInfo;
    //G_LPC546xxPort2Workspace = p;
    p->iLocked = 0;

    LPC546xxPowerOn(kCLOCK_Gpio2);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPIO_Port3_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC546xx GPIO Port3 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPIO_Port3_InitializeWorkspace(void *aWorkspace)
{
    T_LPC546xx_GPIO_Workspace *p = (T_LPC546xx_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC546xx_Port3_PortInfo;
    p->iLocked = 0;

    LPC546xxPowerOn(kCLOCK_Gpio3);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPIO_Port4_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC546xx GPIO Port4 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPIO_Port4_InitializeWorkspace(void *aWorkspace)
{
    T_LPC546xx_GPIO_Workspace *p = (T_LPC546xx_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC546xx_Port4_PortInfo;
    p->iLocked = 0;

    LPC546xxPowerOn(kCLOCK_Gpio4);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPIO_Port5_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC546xx GPIO Port5 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPIO_Port5_InitializeWorkspace(void *aWorkspace)
{
    T_LPC546xx_GPIO_Workspace *p = (T_LPC546xx_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC546xx_Port5_PortInfo;
    p->iLocked = 0;

    LPC546xxPowerOn(kCLOCK_Gpio5);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPIO_Configure
 *---------------------------------------------------------------------------*
 * Description:
 *      Declare which pins on the GPIO port are usable.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aUsablePins         -- Pins allowed
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPIO_Configure(void *aWorkspace, TUInt32 aUsablePins)
{
    //    T_LPC546xx_GPIO_Workspace *p = (T_LPC546xx_GPIO_Workspace *)aWorkspace;

    PARAM_NOT_USED(aUsablePins);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPIO_Activate
 *---------------------------------------------------------------------------*
 * Description:
 *      Declare which pins on the GPIO port are active as GPIO pins.
 *      Once active, the pins are set to GPIO inputs or outputs.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to activate
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPIO_Activate(void *aWorkspace, TUInt32 aPortPins)
{
    // Defunc function
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPIO_Deactivate
 *---------------------------------------------------------------------------*
 * Description:
 *      Declare which pins on the GPIO port are inactive as GPIO pins.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to activate
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPIO_Deactivate(void *aWorkspace, TUInt32 aPortPins)
{
    // Defunc function
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPIO_SetOutputMode
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output mode.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output mode
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPIO_SetOutputMode(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC546xx_GPIO_Workspace *p = (T_LPC546xx_GPIO_Workspace *)aWorkspace;
    const LPC546xx_GPIO_PortInfo *p_info = p->iPortInfo;

