FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_GPIO.c
    if (aPortPinIndex >= 32)
        return UEZ_ERROR_INVALID_PARAMETER;
    if (aMux >= 8)
        return UEZ_ERROR_OUT_OF_RANGE;

    p_iocon = p_info->iIOCONTable[aPortPinIndex];
    if (!p_iocon)
        return UEZ_ERROR_NOT_SUPPORTED;

    /* Change bits 2:0 FUNC */
    *p_iocon = (*p_iocon & ~(7 << 0)) | aMux;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPIO_GetMux
 *---------------------------------------------------------------------------*
 * Description:
 *      Get pin's mux feature.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt8 aPortPinIndex        -- Index to pin 0-31
 *      T_gpioMux aMux              -- Mux setting being used
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPIO_GetMux(
        void *aWorkspace,
        TUInt8 aPortPinIndex,
        T_gpioMux *aMux)
{
    T_LPC546xx_GPIO_Workspace *p = (T_LPC546xx_GPIO_Workspace *)aWorkspace;
    const LPC546xx_GPIO_PortInfo *p_info = p->iPortInfo;
    TVUInt32 *p_iocon;

    if (aPortPinIndex >= 32)
        return UEZ_ERROR_INVALID_PARAMETER;

    p_iocon = p_info->iIOCONTable[aPortPinIndex];
    if (!p_iocon)
        return UEZ_ERROR_NOT_SUPPORTED;

    /* Get bits 2:0 FUNC */
    *aMux = (*p_iocon & (7 << 0));

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Interrupt Routine:  LPC546xx_GPIO_IRQ
 *---------------------------------------------------------------------------*
 * Description:
 *      One of the GPIO interrupts have fired off, do the right one.
 * NOTES:
 *      This routine is inside an interrupt!
 *---------------------------------------------------------------------------*/
static IRQ_ROUTINE(LPC546xx_PIN1_IRQ)
{
    IRQ_START();
    if(*G_Interrupt_Workspace.iIST & (1 << 0)){
        LPC546xx_GPIO_ProcessIRQ(0);
    }

    if(*G_Interrupt_Workspace.iIST & (1 << 1)){
        LPC546xx_GPIO_ProcessIRQ(1);
    }

    if(*G_Interrupt_Workspace.iIST & (1 << 2)){
        LPC546xx_GPIO_ProcessIRQ(2);
    }

    if(*G_Interrupt_Workspace.iIST & (1 << 3)){
        LPC546xx_GPIO_ProcessIRQ(3);
    }

    if(*G_Interrupt_Workspace.iIST & (1 << 4)){
        LPC546xx_GPIO_ProcessIRQ(4);
    }

    if(*G_Interrupt_Workspace.iIST & (1 << 5)){
        LPC546xx_GPIO_ProcessIRQ(5);
    }

    if(*G_Interrupt_Workspace.iIST & (1 << 6)){
        LPC546xx_GPIO_ProcessIRQ(6);
    }

    if(*G_Interrupt_Workspace.iIST & (1 << 7)){
        LPC546xx_GPIO_ProcessIRQ(7);
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPIO_SetInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the GPIO's interrupt mode (enable if not already enabled)
 * Inputs:
 *      void *aWorkspace            -- Particular GPIO workspace
 *      T_gpioInterruptHandler iInterruptCallback -- Routine to call on
 *                                      interrupt.
 *      void *iInterruptCallbackWorkspace -- Workspace of callback
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPIO_ConfigureInterruptCallback(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptHandler aInterruptCallback,
        void *aInterruptCallbackWorkspace)
{
    T_GPIO_Interrupt *p = (T_GPIO_Interrupt *)&G_Interrupt_Workspace.iInterrupt[G_Interrupt_Workspace.iConfiguredInterrupts];

    if(G_Interrupt_Workspace.iConfiguredInterrupts == 8){
        return UEZ_ERROR_OUT_OF_RANGE;
    }

    // Register the interrupt handler if not already registered
    InterruptRegister(G_Interrupt_Workspace.iInterruptNumber[G_Interrupt_Workspace.iConfiguredInterrupts],
            LPC546xx_PIN1_IRQ, INTERRUPT_PRIORITY_HIGH,
            (const char*)G_Interrupt_Workspace.iInterruptName[G_Interrupt_Workspace.iConfiguredInterrupts]);

    G_Interrupt_Workspace.iPINTSEL[G_Interrupt_Workspace.iConfiguredInterrupts] |= ((aPortPins >> 8) * 32) + (aPortPins & 0xF);

    p->iInterruptCallback = aInterruptCallback;
    p->iInterruptCallbackWorkspace = aInterruptCallbackWorkspace;
    p->iPortPin = aPortPins;

    InterruptEnable(G_Interrupt_Workspace.iInterruptNumber[G_Interrupt_Workspace.iConfiguredInterrupts]);
    G_Interrupt_Workspace.iConfiguredInterrupts++;

    return UEZ_ERROR_NONE;
}

T_uezError LPC546xx_GPIO_ConfigureInterruptCallback_NotSupported(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptHandler aInterruptCallback,
        void *aInterruptCallbackWorkspace)
{
    PARAM_NOT_USED(aWorkspace);PARAM_NOT_USED(aInterruptCallback);PARAM_NOT_USED(aInterruptCallbackWorkspace);

    // No IRQs on these
    return UEZ_ERROR_NOT_SUPPORTED;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPIO_ProcessIRQ
 *---------------------------------------------------------------------------*
 * Description:
 *      One of the GPIO ports is reporting an IRQ.  This processes one
 *      of the ports for falling or rising edge events.
 * NOTES:
 *      This routine is inside an interrupt!
 *---------------------------------------------------------------------------*/
void LPC546xx_GPIO_ProcessIRQ(TUInt32 aInterrupt)
{
    T_GPIO_Interrupt *p = (T_GPIO_Interrupt *)&G_Interrupt_Workspace.iInterrupt[aInterrupt];

    // Make sure we have a handler
    if(!p->iInterruptCallback){
        InterruptFatalError();
    }

    p->iInterruptCallback(p->iInterruptCallbackWorkspace,
            p->iPortPin, p->iInterruptType);

    *G_Interrupt_Workspace.iIST |= (1 << aInterrupt);
}


/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPIO_EnableInterrupts
 *---------------------------------------------------------------------------*
 * Description:
 *      Turn on the interrupts for the given type of one or more port pins.
 * Inputs:
 *      void *aWorkspace            -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Masked list of ports to enable.
 *      T_gpioInterruptType aType   -- Type of interrupts to enable.
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPIO_EnableInterrupts(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptType aType)
{
    TUInt32 i;

