FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_GPIO.c
    //Find the interrupt in the workspace
    for(i = 0; i < 8; i++){
        if(aPortPins == G_Interrupt_Workspace.iInterrupt[i].iPortPin){
            break;
        }
    }

    if(i == 8){
        return UEZ_ERROR_OUT_OF_RANGE;
    }

    //Currently only supporting single edge triggering
    *G_Interrupt_Workspace.iISEL &= ~(1 << i);
    if(aType == GPIO_INTERRUPT_FALLING_EDGE){
        *G_Interrupt_Workspace.iSIENF |= (1 << i); //Set Falling Edge
        *G_Interrupt_Workspace.iCIENR |= (1 << i); //Clear Rising Edge
    } else if (aType == GPIO_INTERRUPT_RISING_EDGE){
        *G_Interrupt_Workspace.iSIENR |= (1 << i); //Set Rising Edge
        *G_Interrupt_Workspace.iCIENF |= (1 << i); //Clear Falling Edge
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPIO_DisableInterrupts
 *---------------------------------------------------------------------------*
 * Description:
 *      Turn off the interrupts for the given type of one or more port pins.
 * Inputs:
 *      void *aWorkspace            -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Masked list of ports to disable.
 *      T_gpioInterruptType aType   -- Type of interrupts to disable.
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPIO_DisableInterrupts(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptType aType)
{
    TUInt8 i;

    //Find the interrupt in the workspace
    for(i = 0; i < 8; i++){
        if(aPortPins == G_Interrupt_Workspace.iInterrupt[i].iPortPin){
            break;
        }
    }

    if(i == 8){
        return UEZ_ERROR_OUT_OF_RANGE;
    }

    if(aType == GPIO_INTERRUPT_FALLING_EDGE){
        *G_Interrupt_Workspace.iCIENF |= (1 << i); //Clear Falling Edge
    } else if (aType == GPIO_INTERRUPT_RISING_EDGE){
        *G_Interrupt_Workspace.iCIENR |= (1 << i); //Clear Rising Edge
    }


    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPIO_ClearInterrupts
 *---------------------------------------------------------------------------*
 * Description:
 *      Clear interrupts on a specific GPIO line
 * Inputs:
 *      void *aWorkspace            -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Masked list of ports to disable.
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPIO_ClearInterrupts(void *aWorkspace, TUInt32 aPortPins)
{
    TUInt32 i;

    //Find the interrupt in the workspace
    for(i = 0; i < 8; i++){
        if(aPortPins == G_Interrupt_Workspace.iInterrupt[i].iPortPin){
            break;
        }
    }

    if(i == 8){
        return UEZ_ERROR_OUT_OF_RANGE;
    }

    *G_Interrupt_Workspace.iIST |= (1 << i);

    return UEZ_ERROR_NONE;
}

T_uezError LPC546xx_GPIO_EnableInterrupts_NotSupported(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptType aType)
{
    PARAM_NOT_USED(aWorkspace);PARAM_NOT_USED(aPortPins);PARAM_NOT_USED(aType);
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError LPC546xx_GPIO_DisableInterrupts_NotSupported(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptType aType)
{
    PARAM_NOT_USED(aWorkspace);PARAM_NOT_USED(aPortPins);PARAM_NOT_USED(aType);
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError LPC546xx_GPIO_ClearInterrupts_NotSupported(
        void *aWorkspace,
        TUInt32 aPortPins)
{
    PARAM_NOT_USED(aWorkspace);PARAM_NOT_USED(aPortPins);
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError LPC546xx_GPIO_Control(
        void *aWorkspace,
        TUInt8 aPortPinIndex,
        T_gpioControl aControl,
        TUInt32 aValue)
{
    TVUInt32 *p_iocon;
    T_LPC546xx_GPIO_Workspace *p = (T_LPC546xx_GPIO_Workspace *)aWorkspace;
    const LPC546xx_GPIO_PortInfo *p_info = p->iPortInfo;

    PARAM_NOT_USED(aValue);

    // Look up the IOCON register
    p_iocon = p_info->iIOCONTable[aPortPinIndex];
    if (!p_iocon)
        return UEZ_ERROR_NOT_SUPPORTED;

    switch (aControl) {
        case GPIO_NOP:
            // Yep, do no operation
            break;
        case GPIO_CONTROL_ENABLE_INPUT_BUFFER:
            *p_iocon |= (1 << 7);
            break;
        case GPIO_CONTROL_DISABLE_INPUT_BUFFER:
            *p_iocon &= ~(1 << 7);
            break;
        case GPIO_CONTROL_SET_CONFIG_BITS:
            *p_iocon = aValue;
            break;
        default:
            return UEZ_ERROR_NOT_SUPPORTED;
#if (COMPILER_TYPE != IAR)
            break;
#endif
    }

    return UEZ_ERROR_NONE;
}

T_uezError LPC546xx_GPIO_Lock(void *aWorkspace, TUInt32 aPortPins)
{
#ifndef NDEBUG
    char buffer [50];
#endif
    T_LPC546xx_GPIO_Workspace *p = (T_LPC546xx_GPIO_Workspace *)aWorkspace;
    // Any pins already locked?
    if (p->iLocked & aPortPins) {
        #ifndef NDEBUG
          sprintf (buffer, "PinLock on %s Pin %d", p->iHAL->iInterface.iName, aPortPins);
          UEZFailureMsg(buffer);
        #else
          UEZFailureMsg("PinLock");
        #endif
        return UEZ_ERROR_NOT_AVAILABLE;
    }
    p->iLocked |= aPortPins;
    return UEZ_ERROR_NONE;
}

T_uezError LPC546xx_GPIO_Unlock(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC546xx_GPIO_Workspace *p = (T_LPC546xx_GPIO_Workspace *)aWorkspace;

    p->iLocked &= ~aPortPins;
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * HAL Interface tables:
 *---------------------------------------------------------------------------*/
const HAL_GPIOPort GPIO_LPC546xx_Port0_Interface = {
        {
        "LPC546xx GPIO Port 0",
        0x0106,
        LPC546xx_GPIO_Port0_InitializeWorkspace,
        sizeof(T_LPC546xx_GPIO_Workspace),
        },

        LPC546xx_GPIO_Configure,
        LPC546xx_GPIO_Activate,
        LPC546xx_GPIO_Deactivate,
        LPC546xx_GPIO_SetOutputMode,
        LPC546xx_GPIO_SetInputMode,
        LPC546xx_GPIO_Set,
        LPC546xx_GPIO_Clear,
        LPC546xx_GPIO_Read,
        LPC546xx_GPIO_SetPull,
        LPC546xx_GPIO_SetMux,
        LPC546xx_GPIO_ConfigureInterruptCallback,
        LPC546xx_GPIO_EnableInterrupts,
        LPC546xx_GPIO_DisableInterrupts,
        LPC546xx_GPIO_ClearInterrupts,
        LPC546xx_GPIO_Control,
        LPC546xx_GPIO_Lock,
        LPC546xx_GPIO_Unlock,
        LPC546xx_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC546xx_Port1_Interface = {
        {
        "LPC546xx GPIO Port 1",
        0x0106,
        LPC546xx_GPIO_Port1_InitializeWorkspace,
        sizeof(T_LPC546xx_GPIO_Workspace),
        },

        LPC546xx_GPIO_Configure,
        LPC546xx_GPIO_Activate,
        LPC546xx_GPIO_Deactivate,
        LPC546xx_GPIO_SetOutputMode,
        LPC546xx_GPIO_SetInputMode,
        LPC546xx_GPIO_Set,
        LPC546xx_GPIO_Clear,
        LPC546xx_GPIO_Read,
        LPC546xx_GPIO_SetPull,
        LPC546xx_GPIO_SetMux,
        LPC546xx_GPIO_ConfigureInterruptCallback_NotSupported,
        LPC546xx_GPIO_EnableInterrupts_NotSupported,
        LPC546xx_GPIO_DisableInterrupts_NotSupported,
        LPC546xx_GPIO_ClearInterrupts_NotSupported,
        LPC546xx_GPIO_Control,
        LPC546xx_GPIO_Lock,
        LPC546xx_GPIO_Unlock,
        LPC546xx_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC546xx_Port2_Interface = {
        {
        "LPC546xx GPIO Port 2",
        0x0106,
        LPC546xx_GPIO_Port2_InitializeWorkspace,
        sizeof(T_LPC546xx_GPIO_Workspace),
        },

        LPC546xx_GPIO_Configure,
        LPC546xx_GPIO_Activate,
        LPC546xx_GPIO_Deactivate,
        LPC546xx_GPIO_SetOutputMode,
        LPC546xx_GPIO_SetInputMode,
        LPC546xx_GPIO_Set,
        LPC546xx_GPIO_Clear,
        LPC546xx_GPIO_Read,
        LPC546xx_GPIO_SetPull,
        LPC546xx_GPIO_SetMux,
        LPC546xx_GPIO_ConfigureInterruptCallback,
        LPC546xx_GPIO_EnableInterrupts,
        LPC546xx_GPIO_DisableInterrupts,
        LPC546xx_GPIO_ClearInterrupts,
        LPC546xx_GPIO_Control,
        LPC546xx_GPIO_Lock,
        LPC546xx_GPIO_Unlock,
        LPC546xx_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC546xx_Port3_Interface = {
        {
        "LPC546xx GPIO Port 3",
        0x0106,
        LPC546xx_GPIO_Port3_InitializeWorkspace,
        sizeof(T_LPC546xx_GPIO_Workspace),
        },

        LPC546xx_GPIO_Configure,
        LPC546xx_GPIO_Activate,
        LPC546xx_GPIO_Deactivate,
        LPC546xx_GPIO_SetOutputMode,
        LPC546xx_GPIO_SetInputMode,
        LPC546xx_GPIO_Set,
        LPC546xx_GPIO_Clear,
        LPC546xx_GPIO_Read,
        LPC546xx_GPIO_SetPull,
        LPC546xx_GPIO_SetMux,
        LPC546xx_GPIO_ConfigureInterruptCallback_NotSupported,
        LPC546xx_GPIO_EnableInterrupts_NotSupported,
        LPC546xx_GPIO_DisableInterrupts_NotSupported,
        LPC546xx_GPIO_ClearInterrupts_NotSupported,
        LPC546xx_GPIO_Control,
        LPC546xx_GPIO_Lock,
        LPC546xx_GPIO_Unlock,
        LPC546xx_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC546xx_Port4_Interface = {
        {
        "LPC546xx GPIO Port 4",
        0x0106,
        LPC546xx_GPIO_Port4_InitializeWorkspace,
        sizeof(T_LPC546xx_GPIO_Workspace),
        },

        LPC546xx_GPIO_Configure,
        LPC546xx_GPIO_Activate,
        LPC546xx_GPIO_Deactivate,
        LPC546xx_GPIO_SetOutputMode,
        LPC546xx_GPIO_SetInputMode,
        LPC546xx_GPIO_Set,
        LPC546xx_GPIO_Clear,
        LPC546xx_GPIO_Read,
        LPC546xx_GPIO_SetPull,
        LPC546xx_GPIO_SetMux,
        LPC546xx_GPIO_ConfigureInterruptCallback_NotSupported,
        LPC546xx_GPIO_EnableInterrupts_NotSupported,
        LPC546xx_GPIO_DisableInterrupts_NotSupported,
        LPC546xx_GPIO_ClearInterrupts_NotSupported,
        LPC546xx_GPIO_Control,
        LPC546xx_GPIO_Lock,
        LPC546xx_GPIO_Unlock,
        LPC546xx_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC546xx_Port5_Interface = {
        {
        "LPC546xx GPIO Port 5",
        0x0106,
        LPC546xx_GPIO_Port5_InitializeWorkspace,
        sizeof(T_LPC546xx_GPIO_Workspace),
        },

        LPC546xx_GPIO_Configure,
        LPC546xx_GPIO_Activate,
        LPC546xx_GPIO_Deactivate,
        LPC546xx_GPIO_SetOutputMode,
        LPC546xx_GPIO_SetInputMode,
        LPC546xx_GPIO_Set,
        LPC546xx_GPIO_Clear,
        LPC546xx_GPIO_Read,
        LPC546xx_GPIO_SetPull,
        LPC546xx_GPIO_SetMux,
        LPC546xx_GPIO_ConfigureInterruptCallback_NotSupported,
        LPC546xx_GPIO_EnableInterrupts_NotSupported,
        LPC546xx_GPIO_DisableInterrupts_NotSupported,
        LPC546xx_GPIO_ClearInterrupts_NotSupported,
        LPC546xx_GPIO_Control,
        LPC546xx_GPIO_Lock,
        LPC546xx_GPIO_Unlock,
        LPC546xx_GPIO_GetMux };

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC546xx_GPIO0_Require(void)
{
    HAL_GPIOPort **p_gpio0;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO0",
            (T_halInterface *)&GPIO_LPC546xx_Port0_Interface, 0,
            (T_halWorkspace **)&p_gpio0);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_0, p_gpio0);
}

void LPC546xx_GPIO1_Require(void)
{
    HAL_GPIOPort **p_gpio1;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO1 and allow all pins
    HALInterfaceRegister("GPIO1",
            (T_halInterface *)&GPIO_LPC546xx_Port1_Interface, 0,
            (T_halWorkspace **)&p_gpio1);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_1, p_gpio1);
}

void LPC546xx_GPIO2_Require(void)
{
    HAL_GPIOPort **p_gpio2;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO2 and allow all pins
    HALInterfaceRegister("GPIO2",
            (T_halInterface *)&GPIO_LPC546xx_Port2_Interface, 0,
            (T_halWorkspace **)&p_gpio2);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_2, p_gpio2);
}

void LPC546xx_GPIO3_Require(void)
{
    HAL_GPIOPort **p_gpio3;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO3 and allow all pins
    HALInterfaceRegister("GPIO3",
            (T_halInterface *)&GPIO_LPC546xx_Port3_Interface, 0,
            (T_halWorkspace **)&p_gpio3);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_3, p_gpio3);
}

void LPC546xx_GPIO4_Require(void)
{
    HAL_GPIOPort **p_gpio4;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO4 and allow all pins
    HALInterfaceRegister("GPIO4",
            (T_halInterface *)&GPIO_LPC546xx_Port4_Interface, 0,
            (T_halWorkspace **)&p_gpio4);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_4, p_gpio4);
}

void LPC546xx_GPIO5_Require(void)
{
    HAL_GPIOPort **p_gpio5;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO5 and allow all pins
    HALInterfaceRegister("GPIO5",
            (T_halInterface *)&GPIO_LPC546xx_Port5_Interface, 0,
            (T_halWorkspace **)&p_gpio5);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_5, p_gpio5);
}

/*-------------------------------------------------------------------------*
 * End of File:  GPIO.c
 *-------------------------------------------------------------------------*/
